[{"id":15704415301087048,"title":"UI5 tooling extensibility + CAP + Testing = nice","type":"presentation_long","description":"taking you through a journey on extending the ui5 tooling (demoing from the ecosystem showcase https://github.com/petermuessig/ui5-ecosystem-showcase), how to combine it with the Cloud Application Programming Model (CAP, Node.js flavor), throwing in some Testing best practices (Unit, OPA, UIveri5) and demoing why this is a nice development experience","location":"demo_03","startTime":"10:00","endTime":"10:45","speakers":[{"firstName":"Volker","lastName":"Buzek","company":"j+s-soft GmbH","bio":"Development Architect Mobility in the SAPverse. I like trying out unconventional stuff with UI5 :) Still having that dream of bringing Scuba diving + IT together.","photoUrl":"d0a5f200bc27f0c411afa54e988380809dc3b676"}],"presentationLinks":[{"_id":"5e4ce6b3c7b8c3003f112d14","linkType":"Slides","url":"https://vobu.github.io/materials/ui5con_2020_BE/"},{"_id":"5e4ce6b3c7b8c3003f112d13","linkType":"code","url":"https://github.com/petermuessig/ui5-ecosystem-showcase/tree/feature/cap"}]},{"id":157122948310746560,"title":"Consume UI5 Web Apps from the HTML Application Repository","type":"presentation_long","description":"While the development of the OpenUI5 technology advances with incredible speed, one thing remained almost constant for a very while time: The deployment flow of the web app to the Cloud Foundry environment. For years, we embedded the minified UI project as a static resource in the Approuter module. While this approach works fine in simple scenarios, it might reach its limits when the application needs to scale. In this session, I will explain the disadvantages of the old approach and how to overcome them with the HTML5 Application Repository service. ","location":"demo_03","startTime":"14:05","endTime":"14:50","speakers":[{"firstName":"Marius","lastName":"Obert","company":"SAP SE","bio":"Marius started his software-development-career as a UI developer in sunny California. After many ugly fights against CSS, he decided to relocate to Munich where he now works as a Developer Advocate for the SAP Cloud Platform and SAP UI technologies. In his spare time, he tries to keep up to speed with distributed ledger technologies.","photoUrl":"e58d225721a89b5476461e2390d81234594a8855"}],"presentationLinks":[{"_id":"5e4c08f74cf26b003f041eb9","linkType":"Slides","url":"https://www.slideshare.net/MariusObert/consume-ui5-web-apps-from-the-html5-application-repository-227873406"},{"_id":"5e4c08f74cf26b003f041eb8","linkType":"GitHub Sample Project","url":"https://github.com/SAP-samples/ui5-webcomponents-sample-react/tree/SAP-Cloud-Platform"}]},{"id":157138367381021980,"title":"Don't be scared for CAP, Odata V4 can work in production","type":"presentation_long","description":"The past few months we have build a set of new applications using CAP and the Cloud SDK. Some of which meant that we had to use Odata V4. While it was not always perfect and took some getting used to, we managed to build the application that way and in the end we now love V4. And some of that love and lessons learned I will be sharing. ","location":"demo_02","startTime":"13:10","endTime":"13:55","speakers":[{"firstName":"Vincent","lastName":"Weiss","company":"Dimensys","bio":"Twitter: vfweiss\nWorking with UI5 for quite some years already and now building apps on Cloud Foundry with CAP, Odata V4 and the latest UI5.","photoUrl":"39298bbbb7f3377762d30c820979d44c53f63818"}],"presentationLinks":[{"_id":"5e4cf536c7b8c3003f112d1d","linkType":"Slides","url":"https://slideshare.net/VincentWeiss1/ui5conbe-odata-v4-presentation"}]},{"id":157190498642073020,"title":"UI5 in 202x","type":"presentation_long","description":"It's now 2020 and UI5 has been around for a while. \nMeanwhile other framework have come (and gone for some of them), with new patterns, new technologies and globally the javascript ecosystem has grown.\nIn this talk I'll go over some of the things that we can do, even today, with UI5 to get a slightly more \"modern\" experience, as well as open new doors at what could be done in the future to make things even better.\nThis talk will cover things such as es6, transpiling, typescript, jsx and the like all while leveraging the ui5 ecosystem like the tooling or the ui5-typescript definition.","location":"demo_03","startTime":"11:25","endTime":"12:10","speakers":[{"firstName":"Nicolas","lastName":"Lunet","company":"SAP","bio":"Hi, I'm Nicolas, I'm one of the Fiori Elements v4 architect.\nI've been at SAP for 10 years and was part of the original Fiori Waves (and precursors), the Build project and now the Fiori Elements.\n","photoUrl":"f826d1c0c6e7ffcff8053233c475f9c8ff245fb4"}],"presentationLinks":[]},{"id":157191147637829200,"title":"Plugin Showcase","type":"presentation_long","description":"A hugely underestimated feature of the Fiori launchpad, is the ability to create plugins that are available from the header, at all times.\nWe've already created multiple plugins to make our day to day life easier, and we know that there are others available in github repo's all around.\nWhat is missing is a tool to easily test such plugins, with a local launchpad.\nThis is what we want to present to you:\nA local launchpad that automatically bundles freely available plugins and makes it easy to try them out.","location":"demo_02","startTime":"15:45","endTime":"16:30","speakers":[{"firstName":"Tom","lastName":"Van Doorslaer","company":"Fiddle","bio":"You know who I am.","photoUrl":"772b91bc15fe8d7ce0a58e7c9fddf90073006b83"},{"firstName":"Wouter","lastName":"Lemaire","company":"","bio":"SAP Developer, SAPMentor, Dad of a cool boy, Pushing UI5 to it limits","photoUrl":"d2bd2b0c262e83366102609025c858d1523427ac"}],"presentationLinks":[{"_id":"5e4cef46c7b8c3003f112d1a","linkType":"Slides","url":"https://drive.google.com/file/d/16EfhKBpzjkJB5_KX7iQvm9FHICjeyVSY/view?usp=sharing"}]},{"id":157191949010211000,"title":"Get started with the new UI5 Tooling","type":"presentation_long","description":"Now with the new UI5 tooling, SAP provides a solution that closes the gap between local UI5 development and SAP Web IDE. It provides tools that replace the third-party tools and give you the same possibilities that comes out-of-the-box in SAP Web IDE.\nUI5 Tooling is the key enabler to free your developers. Developers can choose for SAP Web IDE or any other local IDE. They will have all tools in any IDE to create their UI5 app.\nSAP Web IDE is great, especially for beginners, but experienced UI5 developers will prefer their local IDE. Local IDE’s, like VSCode, also offer a nice Development eXperience.\nYou'll notice that switching to another IDE, requires a lot of configuration that comes out of the box in SAP Web IDE. In this session, I want to share how you can start using the UI5 Tooling starting from an existing UI5 app developed in SAP Web IDE. In the end, you'll have exactly the same features as in SAP Web IDE and even more :)","location":"demo_02","startTime":"10:00","endTime":"10:45","speakers":[{"firstName":"Wouter","lastName":"Lemaire","company":"","bio":"SAP Developer, SAPMentor, Dad of a cool boy, Pushing UI5 to it limits","photoUrl":"d2bd2b0c262e83366102609025c858d1523427ac"}],"presentationLinks":[{"_id":"5e4ceeafc7b8c3003f112d17","linkType":"Slides","url":"https://lemaiwo.github.io/UI5conBE2020/"}]},{"id":157216568845681440,"title":"UI5 with Typescript","type":"presentation_long","description":"In this session I will show how to use Typescript in a real life UI5 project. I will talk about Typescript in general and why it is better than plain Javascript. Then I will show a real life project I realized with Typescript and UI5. In this code I will point out some specialities I had to implement and follow to leverage Typescript.","location":"demo_02","startTime":"11:25","endTime":"12:10","speakers":[{"firstName":"Helmut","lastName":"Tammen","company":"TAMMEN IT SOLUTIONS","bio":"SAP Solution / Software Architect, Developer, SAP Enthusiast, Node and Javascript lover","photoUrl":"cbe3626d21a2f48a32b79ab5343d61a0dbda46dd"}],"presentationLinks":[{"_id":"5e4d033fc7b8c3003f112d20","linkType":"Presentation, Code, Github project","url":"https://github.com/htammen/ui5con_typescript"}]},{"id":157233380771825800,"title":"Lessons learned of working with Components and Composite Controls","type":"presentation_long","description":"During this sessions we are going to explore UI5 Components and Composite Controls and the combination of the two. We will go deeper in the lessons learned we've had from working with them.","location":"demo_03","startTime":"13:10","endTime":"13:55","speakers":[{"firstName":"Robin","lastName":"Panneels","company":"Canguru Solutions","bio":"SAP Technical consultant at Canguru Solutions. Proud father of a little baby girl. Technology enthusiast.\nTwitter handle: @rpanneel","photoUrl":"3c99c62e138a12ab2b21cafebf5ea3e2cd6129d5"}],"presentationLinks":[]},{"id":157252221946096260,"title":"Boost your UI5 apps with Server-Side rendering","type":"presentation_short","description":"Ever wondered how to speed up your application's initial load time or create SEO-optimized webpages within the paradigm of UI5? Well, we did the same.\nIn this lightning talk, we cover how you can boost your UI5 application's perceived performance by leveraging server-side rendering powered by puppeteer and NodeJs. ","location":"demo_03","startTime":"15:15","endTime":"15:35","speakers":[{"firstName":"Nitish","lastName":"Mehta","company":"INTEGRTR","bio":"Entrepreneur , Techie , JavaScript Enthusiast.\nI love exploring the world as much as I love exploring new technology :)\n\n\nAvailable here :  https://twitter.com/nitish_mehta and https://www.linkedin.com/in/nitishmehta08","photoUrl":"cfebc4b69a4af360fcd04dba103056e9d8ec526d"},{"firstName":"Vaibhav","lastName":"Arora","company":"Klarna","bio":"Software developer passionate about web and performance. Former SAP UI5 developer, openUI5 contributor and currently developing FinTech solutions at Klarna in Stockholm.","photoUrl":"ee98f93130e58f58885d3117f0fead7d5d6cdd3e"}],"presentationLinks":[{"_id":"5e4c2536c7b8c3003f112d0d","linkType":"Slides","url":"https://www.slideshare.net/NitishMehta2/ui5con-belgium-boost-your-ui5-apps-with-server-side-rendering"}]},{"id":157252558356747550,"title":"Fast, Easy and Reliable testing of UI5 apps with Cypress","type":"presentation_short","description":"We've all been guilty of skipping front-end application testing or delaying it to a point where it just feels like a lot of effort ;)\n\nThrough this talk, we want to introduce everyone to 'cypress' and how it can make the cumbersome integration testing actually fun and easy. We will start from installation and then proceed to create some integration tests for one of the open-source OpenUI5 applications.","location":"demo_03","startTime":"10:55","endTime":"11:15","speakers":[{"firstName":"Nitish","lastName":"Mehta","company":"INTEGRTR","bio":"Entrepreneur , Techie , JavaScript Enthusiast.\nI love exploring the world as much as I love exploring new technology :)\n\n\nAvailable here :  https://twitter.com/nitish_mehta and https://www.linkedin.com/in/nitishmehta08","photoUrl":"cfebc4b69a4af360fcd04dba103056e9d8ec526d"},{"firstName":"Vaibhav","lastName":"Arora","company":"Klarna","bio":"Software developer passionate about web and performance. Former SAP UI5 developer, openUI5 contributor and currently developing FinTech solutions at Klarna in Stockholm.","photoUrl":"ee98f93130e58f58885d3117f0fead7d5d6cdd3e"}],"presentationLinks":[{"_id":"5e4c2510c7b8c3003f112d0a","linkType":"Slides","url":"https://www.slideshare.net/NitishMehta2/ui5con-2020-belgium-fast-easy-and-reliable-testing-of-openui5-apps-with-cypress"},{"_id":"5e4c2510c7b8c3003f112d09","linkType":"Test App","url":"https://translate.integrtr.com/"}]},{"id":157253101786376060,"title":"SAPUI5 Controls vs. UI5 Web Components - Practical Experiences","type":"presentation_short","description":"Everyone is talking about UI5 Web Components and how they provide enterprise class re-usable UI elements for a broad range of web frameworks. We decided to take a deeper look and compared ‘classical’ SAPUI5 with the UI5 Web Components in a real-world example using React.js. By developing a similar looking frontend in both frameworks, we had the chance to analyse the development-process and the resulting apps under several aspects.\n\n•\tDocumentation: How helpful / applicable are the different developer-documentations?\n•\tScope: How many predefined controls / components are available? Is the scope sufficient for real-world scenarios?\n•\tNon-control-elements and flexibility: What is needed to build something I cannot represent as a control / component? Which approach provides more possibilities?\n•\tPerformance: Measured performance using a user-centered approach with Google Lighthouse.\n•\tAccessibility: Are UI5 Controls and UI5 Web Components both really enterprise ready and equal? Or are there any differences that developers must take into account?\n•\tOther striking differences we noticed during implementation e.g. different programming models and the need of custom CSS\n \nWe would love to share our experiences with the UI5 community and give further insights into the different scenarios.\n","location":"demo_02","startTime":"10:55","endTime":"11:15","speakers":[{"firstName":"Fabienne","lastName":"Pipping","company":"advades GmbH","bio":"UX Designer and Software Developer, always trying to find the sweet spot between people, technology and business. I'm a Masters student of Media Computer Science and have been working at advades GmbH (https://www.advades.com) for about 1 year.","photoUrl":"8595bfec3445fef5545011313437dd5ae749db88"},{"firstName":"Alexander","lastName":"Seibel","company":"advades GmbH","bio":"Since my teenage years, I've been in love with software development. So I made my hobby a  profession and became a SAP Software Development Consultant at advades GmbH (https://www.advades.com). Today I have more than 6 years experience in building SAP Fiori Apps with SAPUI5.","photoUrl":"188d0c03b8d2eb2a7465e87cd8bafdaccbefa16b"}],"presentationLinks":[{"_id":"5e5d19d07b8ffa003f010dfd","linkType":"Slides","url":"https://fabyp.github.io/ui5con-presentation/#/"}]},{"id":157253965817728500,"title":"Fiori at scale tooling that cuts deployment time","type":"presentation_long","description":"Many SAP S/4 HANA project management offices and UX design leads struggle with the best way to document the applications that the project team sets in the course of implementation. Projects often use complex Excel spreadsheets to track the standard and custom apps in scope, an approach that is both labor-intensive and subject to errors.\n\nThis was precisely the challenge that the team I worked with faced one year back, on S/4 HANA implementation. Together with other Fiori Tracker developers, we decided to prepare the SAP Fiori application that addressed this challenge. The presentation will cover the main features of the tool we have developed.","location":"demo_02","startTime":"14:05","endTime":"14:50","speakers":[{"firstName":"Greg","lastName":"Malewski","company":"Nype","bio":"SAP UI5 developer lead on Fiori Tracker and Nype teams. Extensive experience in running SAP implementation projects, SAP capability, and SAP software development teams. Worked as an SAP educational center instructor and on projects for BMW, VW, Hilti, GSK, and Roche. Occasionally can wakeboard kind of all right.","photoUrl":"9c82869cbe3d4bd10e889e100c0c00b8ae1a119a"}],"presentationLinks":[{"_id":"5e4d413ec7b8c3003f112d31","linkType":"Slides","url":"https://www.slideshare.net/malewskig/fiori-at-scale-tooling-that-cuts-deployment-time"}]},{"id":157528767690417540,"title":"Create SAPUI5 Applications with Google Firebase","type":"presentation_long","description":"Integrate Firebase into your SAPUI5 Applications. Use the Firebase Cloud Firestore Database as a back-end, together with the SAPUI5 Framework to create a Real-time Web Applications.","location":"demo_03","startTime":"15:45","endTime":"16:30","speakers":[{"firstName":"Dries","lastName":"Van Vaerenbergh","company":"Flexso Digital","bio":"Young Developer who is especially interested in SAP UI5 Development and SAP Leonardo Innovation.\nhttps://people.sap.com/vvdries\nTwitter @vvdries","photoUrl":"e758135f8bb2bb364e7f7a3d4f344eaf9155653b"}],"presentationLinks":[{"_id":"5e4c126b4cf26b003f041ee6","linkType":"GitHub Project + Slides","url":"https://github.com/vvdries/SAP-Firebase-Connect"}]},{"id":157701474158225500,"title":"Keynote","type":"keynote","description":"The UI5con Belgium Keynote","location":"demo_02","startTime":"9:10","endTime":"9:55","speakers":[{"firstName":"Stefan","lastName":"Beck","company":"SAP SE","bio":"I'm the Chief Product Owner of SAPUI5 and leading the project from it's very beginning in 2009. I started at SAP SE in 1997 and was working in various roles before joining the UI development area. I'm married, have 2 sons at 10 and 13 and as hobbies, I like reading, cycling, swimming and basketball.","photoUrl":"45a7f96f54109bfb9b4aca5e0e70bbfa58daa9cf"},{"firstName":"Peter","lastName":"Muessig","company":"SAP SE","bio":"Peter is one of the initiators who started the Phoenix project (a.k.a. OpenUI5/SAPUI5). Today he is working as Lead Architect for OpenUI5/SAPUI5.","photoUrl":"a0ee149f7ca30247da0dc69a05255441ec1f75d6"}],"presentationLinks":[{"_id":"5e6f26ca7b8ffa003f010e23","linkType":"Slides","url":"https://www.slideshare.net/PeterMuessig1/ui5conbe-2020-keynote"}]},{"id":157701484679922460,"title":"Welcome","type":"other","description":"Welcome to UI5con Belgium","location":"demo_02","startTime":"9:00","endTime":"9:10","speakers":[{"firstName":"Nicolas","lastName":"Goris","company":"Flexso Digital","bio":"I am a dynamic and enthusiastic SAP consultant enabling my customers to turn their dreams into reality.\nSharing knowledge and making sure that we can all enjoy the SAP world is one of my goals!","photoUrl":"b8b31f36dfd7dd2faea8ddf3f43d925ddc6787f5"}],"presentationLinks":[{"_id":"5e4bcdf0640f290041849777","linkType":"Slides","url":"https://www.slideshare.net/NicolasGoris/20200214-welcome-see-you-soon"}]},{"id":157899177998972960,"title":"Develop custom UI5 libraries in SAP Web IDE","type":"presentation_short","description":"In this session I will show you how to develop custom SAPUI5 libraries using the SAP Web IDE, and how to consume them in your applications","location":"demo_02","startTime":"15:15","endTime":"15:35","speakers":[{"firstName":"Thomas","lastName":"Nelissen","company":"Flexso Digital","bio":"","photoUrl":"ff2b91e057d6c689ce268bb854eb1515070118fb"}],"presentationLinks":[{"_id":"5e4c4c49c7b8c3003f112d10","linkType":"Slides","url":"https://www.slideshare.net/ThomasNelissen/develop-custom-sapui5-libraries-using-sap-web-ide"}]}]